present/lhopital/index.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-05 Tue 18:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>L'Hôpital's rule</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sandy Urazayev" />
<meta name="version" content="S5 1.2a2" />
<meta name='defaultView' content='slideshow' />
<meta name='controlVis' content='hidden' />
<!-- style sheet links -->
<link rel='stylesheet' href='/ui/outline.css' type='text/css' media='screen' id='outlineStyle' />
<link rel='stylesheet' href='/ui/print.css' type='text/css' media='print' id='slidePrint' />
<link rel='stylesheet' href='/ui/opera.css' type='text/css' media='projection' id='operaFix' />
<link rel='stylesheet' href='/ui/slides.css' type='text/css' media='screen' id='slideProj' />
<!-- S5 JS -->


</head>
<body>
<div class="layout">
<div id="controls"><!-- no edit --></div>
<div id="currentSlide"><!-- no edit --></div>
<div id="header" class="status">
&#x20;
</div>

<div id="footer" class="status">
<h1>Sandy Urazayev - L'Hôpital's rule</h1>
</div>

</div>
<div id="content" class="presentation">
<div id='title-slide' class='slide'>
<h1>L'Hôpital's rule</h1>
     <h2></h2>
     <h2>Sandy Urazayev</h2>
     <h3><a href="mailto:ctu@ku.edu">ctu@ku.edu</a></h3>
     <h4>5; 12021 H.E.</h4>
</div>

<div id="outline-container-org2c314ed" class="outline-2  slide">
<h2 id="org2c314ed"><span class="section-number-2">1</span> Quick recap</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Limit of a function</b> is a fundamental concept in calculus and analysis
concerning the behavior of that function near a particular input.
</p>

<p>
Examples:
</p>
<ul class='org-ul'>
<li>\(\lim_{x \to 2} x = 2\)</li>
<li>\(\lim_{x \to 5} (x-1) = 4\)</li>
<li>\(\lim_{x \to 0} x^2 = 0\)</li>
<li>\(\lim_{x \to 0} \sin(x) = 0\)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc54df59" class="outline-2  slide">
<h2 id="orgc54df59"><span class="section-number-2">2</span> Fact</h2>
<div class="outline-text-2" id="text-2">
<p>
Limit of a fraction of two functions equals to the fraction of limits of those
two functions.
</p>

\begin{equation*}
  \lim_{x \to a} \frac{f(x)}{g(x)} = \frac{\lim_{x \to a}f(x)}{\lim_{x \to a}g(x)}
\end{equation*}

<p>
Examples:
</p>
<ul class='org-ul'>
<li>\(\lim_{x \to 3} \frac{x-1}{x+2} = \frac{\lim_{x \to 3}(x-1)}{\lim_{x \to
    3}(x+2)} = \frac{2}{5}\)</li>
</ul>
</div>
</div>

<div id="outline-container-org49714ca" class="outline-2  slide">
<h2 id="org49714ca"><span class="section-number-2">3</span> Motivation</h2>
<div class="outline-text-2" id="text-3">
<p>
What if our limit of functions is undefined? In essence, what if our final
fraction is \(\frac{0}{0}\) or \(\frac{\infty}{\infty}\)?
</p>

<p>
Examples:
</p>
<ul class='org-ul'>
<li>\(\lim_{x \to 0} \frac{\sin(x)}{x} = \frac{\lim_{x \to 0} \sin(x)}{\lim_{x \to 0} x} = \frac{0}{0}\)</li>
<li>\(\lim_{x \to \infty} \frac{x}{e^x} = \frac{\lim_{x \to \infty} x}{\lim_{x
    \to \infty} e^x} = \frac{\infty}{\infty}\)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf95ea44" class="outline-2  slide">
<h2 id="orgf95ea44"><span class="section-number-2">4</span> Definition</h2>
<div class="outline-text-2" id="text-4">
<p>
Let \(f\) and \(g\) be both differentiable (derivatives \(f'\) and \(g'\) exist and
are defined), if \(\lim_{x \to a} f(x) = \lim_{x \to a} g(x) = 0\) or \(\pm \infty\)
for all \(x\) in the domain with \(x \neq a\), then
</p>

\begin{equation*}
  \lim_{x \to a} \frac{f(x)}{g(x)} = \lim_{x \to a} \frac{f'(x)}{g'(x)}
\end{equation*}
</div>
</div>

<div id="outline-container-orgacf064f" class="outline-2  slide">
<h2 id="orgacf064f"><span class="section-number-2">5</span> Worked examples</h2>
<div class="outline-text-2" id="text-5">
<p>
Recall some examples from Motivation
</p>

\begin{align*}
        \lim_{x \to 0} \frac{\sin(x)}{x}
         & = \lim_{x \to 0} \frac{(\sin(x))'}{(x)'} \\
         & = \lim_{x \to 0} \frac{\cos(x)}{1}       \\
         & = \lim_{x \to 0} \cos(x) = 1
\end{align*}

<p>
This means that as \(x\) gets infinitely small, \(\sin(x)\) and \(x\) tend to have
the same value! 
</p>
</div>
</div>

<div id="outline-container-orgbe7babb" class="outline-2  slide">
<h2 id="orgbe7babb"><span class="section-number-2">6</span> Extra example</h2>
<div class="outline-text-2" id="text-6">
<p>
Our second example from motivation
</p>

\begin{align*}
        \lim_{x \to \infty} \frac{x}{e^x}
         & = \lim_{x \to \infty} \frac{(x)'}{(e^x)'} \\
         & = \lim_{x \to \infty} \frac{1}{e^x}       \\
         & = \frac{1}{\lim_{x \to \infty} e^x} = 0
\end{align*}

<p>
So as \(x\) gets infinitely large, \(e^x\) is getting larger much quicker than \(x\)
does! 
</p>
</div>
</div>


</div>
</body>
</html>
